{"Data":{"Sdk":{"Events":[{"Id":"21230400677","Type":"PullRequestEvent","CreatedAt":"2022-04-11T19:54:19","Actor":"PrzemyslawKlys","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"opened","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/pull/1140","RelatedDescription":"Opened pull request \"Add OfficeIMO to related tools\" (#1140) at OfficeDev/Open-XML-SDK","RelatedBody":"I've added OfficeIMO (https://github.com/EvotecIT/OfficeIMO) to related tools. It heavily simplifies working with Microsoft Word documents. Adding sections, page breaks, changing page orientation, adding cover pages, table of contents, and other things is a lot easier than trying to do it manually using OpenXML SDK."},{"Id":"21131220651","Type":"IssuesEvent","CreatedAt":"2022-04-05T22:42:52","Actor":"twsouthwick","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"reopened","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/issues/561","RelatedDescription":"Reopened issue \"Open-Xml-SDK cannot load document referencing not installed font when x14ac:knownFonts is present\" (#561) at OfficeDev/Open-XML-SDK","RelatedBody":"**Description**\r\n\r\nOpen-Xml-SDK will throw an OpenXmlPackageException with the message \"The specified package is invalid. The main part is missing.\" when an excel file references fonts in worksheets that are not present on the system and the tag x14ac:knownFonts is found.\r\n\r\n**Information**\r\n\r\n- .NET Target: .Net Framework 4.7.1\r\n- DocumentFormat.OpenXml Version: 2.8.1 and 2.9.0\r\n\r\n**Repro**\r\nWe use Open-XML SDK to produce a file (with lots of data) that we give to 3rd parties scattered around the world. They edit that file and send them back for us to import (using Open-Xml SDK again).\r\n\r\nSometimes we have this error from the exception while loading the document using Open-Xml SDK: The specified package is invalid. The main part is missing.\r\n\r\nIf I save the file with my own Excel application (Excel 2016) prior to import it, I can import the file fine. So I've decompressed the xlsx files and compared both against each other (the one working and the one not working)\r\nThe only thing that was different is the presence of the tag x14ac:knownFonts\r\nhttps://docs.microsoft.com/en-us/dotnet/api/documentformat.openxml.spreadsheet.fonts.knownfonts?view=openxml-2.8.1 Value of the tag is 1. If I remove the worksheet that uses the fonts found in the styles.xml, I can load the document or if I remove the \"knownfonts\" tag and let the worksheets that reference those fonts: Open-Xml-SDK can open the file successfully again.\r\n\r\n**Observed**\r\n\r\nThe excel app that was used to save the excel is the same version than me (2016), but installed in Korean language. Two of the fonts referenced have their name in asian characters so my wild guest is that I don't have those fonts on my system, and with the presence of the knownfonts, it causes Open-Xml to die painfully when trying to load that document.\r\n\r\n**Expected**\r\n\r\nI would expect that Open-Xml don't die when loading an excel document with if that tag is found (and fonts that I don't have on my system are referenced in that excel document). Excel do not die from actually: it allow me to open the document resave it (effectively removing that infamous \"knownfonts\" tag.\r\n"},{"Id":"21023579553","Type":"IssuesEvent","CreatedAt":"2022-03-30T17:04:03","Actor":"atrauzzi","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"opened","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/issues/1139","RelatedDescription":"Opened issue \"`SaveAs` also saves the original.\" (#1139) at OfficeDev/Open-XML-SDK","RelatedBody":"# Before submitting an issue, please fill this out\r\n\r\n**Description**\r\n\r\nWhen I open a document, make changes to some of its elements and later call `SaveAs`, the original source file also appears to be overwritten.\r\n\r\nThis happens even when I set `AutoSave` to false and does not happen prior to disposal.\r\n\r\n**Expected**\r\n\r\nMy initial assumption was that calling `SaveAs` would result in the source file never being altered.  Similar for example to how a save-as operation in an editor would work.  There's some degree of surprise in the current behaviour.\r\n"}],"ResultType":"GitHubEvent"}},"RunOn":"2022-04-12T03:30:26.907734Z","RunDurationInMilliseconds":567}