{"Data":{"Sdk":{"Events":[{"Id":"25008628239","Type":"IssuesEvent","CreatedAt":"2022-11-03T13:46:43","Actor":"Asbjoedt","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"opened","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/issues/1223","RelatedDescription":"Opened issue \"Support validation of conformance\" (#1223) at OfficeDev/Open-XML-SDK","RelatedBody":"**Is your feature request related to a problem? Please describe.**\r\nIn the following, I will be referring to code adopted in the context of spreadsheets and therefore not all code pieces may be reuseable for text or presentations.\r\n\r\nOpen XML SDK currently supports the two following means of identifying OOXML conformance (either Transitional or Strict).\r\n\r\nFirst, you have the class ```Conformance```, which is a property saved to ```workbook.xml`` based on the ```ConformanceClass enum```. So you have to go to ```WorkbookPart.Workbook.Conformance``` to find this.\r\n\r\nSecond, you have ```StrictRelationshipFound```, which is a bool value you can fetch from root level. Here's the code in Open XML SDK:\r\n```\r\n/// <summary>\r\n/// Gets a value indicating whether this package contains Transitional relationships converted from Strict.\r\n /// </summary>\r\npublic bool StrictRelationshipFound { get; private set; }\r\n```\r\n\r\nThe question is whether if these two ways of identifying conformance, actually checks for a VALID STRICT or VALID TRANSITIONAL OOXML file? With conformance class, it only fetches the property, meaning it does not check if any INVALID TRANSITIONAL features appear in the file. I don't know how StrictPropertyRelationship works, and judging from the summary, it only finds existing Transitional files, that have been converted to Strict conformance, but it does not identify Strict files created as Strict. However, when I test this on files, whether the file was Transitional has no relevance, it will find any Strict file. But how is this qualified, will it simply look for the conformance class value or will it also check for existence of X, Y, Z properties for instance many namespaces are different between the two conformance modes and these chold be checked.\r\n\r\nI think it is OK, if both of the outlined means of identification are acceptable, if they simply check for conformance class value, but I don't think this is sufficient for validation of a VALID STRICT or VALID TRANSITIONAL file. All differences specified in the OOXML ISO standard should be separated into two different ways of validation a file. At the moment the validator does not distinct between a Transtional and a Strict file, so how can I know if a Strict does not contain any Transitional features, it is not allowed to contain?\r\n\r\nI refer to this issue about discussion on Strict validation and a brief (I have not have found all) outlining of conformance differences as outlined in the OOXML standard: https://github.com/mikeebowen/ooxml-validator-vscode/issues/14\r\n\r\n**Describe the solution you'd like**\r\nThe Open XML SDK validator method is this:\r\n```\r\nvar validator = new OpenXmlValidator();\r\nvar validation_errors = validator.Validate(spreadsheet).ToList();\r\n```\r\n\r\nWhat we need is a parameter for method ```Validate()``` to specify which conformane should the document be validated against: ```transitional``` or ```strict``` and for this purpose can the ```[ConformanceClass enum](https://learn.microsoft.com/en-us/dotnet/api/documentformat.openxml.spreadsheet.conformanceclass?view=openxml-2.8.1)``` be used.\r\n\r\nThen it should report errors if Strict is validated, which may not be errors for Transitional and vice versa. If no errors is reported, then the file is by logic valid, or you can create a bool or any other value to return determining succesful validation.\r\n\r\n**Describe alternatives you've considered**\r\nUnfortunately, I know of no other OOXML validators out there. I think it is crucial, that Microsoft fully supports the OOXML ISO standard, which means supporting Strict conformance. The life cycle of data begins with creation and ends with deletion or achiving. Right now this life cycle is not fully supported, because data quality for archiving means Strict conformance of OOXML.\r\n\r\n**Additional context**\r\nHere's my prototype repo for digital archiving of spreadsheets using Open XML SDK. You can find info on Strict conformance in the wiki: https://github.com/Asbjoedt/CLISC\r\n"},{"Id":"24936962972","Type":"PullRequestEvent","CreatedAt":"2022-10-31T15:49:33","Actor":"mikeebowen","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"opened","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/pull/1222","RelatedDescription":"Opened pull request \"Update SVG package to fix\" (#1222) at OfficeDev/Open-XML-SDK","RelatedBody":"Update SVG package to fix [CVE-2021-26701](https://github.com/advisories/GHSA-ghhp-997w-qr28)"},{"Id":"24933947869","Type":"IssuesEvent","CreatedAt":"2022-10-31T13:50:48","Actor":"maurymarkowitz","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"opened","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/issues/1221","RelatedDescription":"Opened issue \"Open XML Productivity Tool should normally open files read-only\" (#1221) at OfficeDev/Open-XML-SDK","RelatedBody":"I mostly use the Open XML Productivity Tool as a diff system, and it's proved very useful in this role. However, the tool appears to open all files read-write, which means I can't run my own Packaging code while I have a diff open in Tool.\r\n\r\nThis is frustrating because debugging packaging/openxml code often consists of finding a problem in the diff, fixing your code, and then attempting to re-export your file. Since Tool has the file locked, the only way to write a new version is to quit Tool, run your code, quit your code (because it won't open a file open elsewhere), and then go through the entire diff process again.\r\n\r\nI don't see any way to change a file using the Tool, so it does not appear there is any need for the files to be opened read-write. Changing this to read-only, even if just in diff, would greatly improve workflow."},{"Id":"24848327327","Type":"IssuesEvent","CreatedAt":"2022-10-26T17:44:37","Actor":"Th3AnG3L","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"opened","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/issues/1219","RelatedDescription":"Opened issue \"Bug with Open XML SDK\" (#1219) at OfficeDev/Open-XML-SDK","RelatedBody":"Hello i'm having an issue..\r\nI download from nuget latest version 2.18.0\r\nand on my pc program that i build on vb.net works fine..\r\nBut i put the program on another computer and where it uses the library shows error:\r\n\r\nSystem.IO.FileLoadException: Could not load file or assembly 'DocumentFormat.OpenXml, Version=2.7.2.0, Culture=neutral, PublicKeyToken=8fb06cb64d019a17' or one of its dependencies. The located assembly's manifest definition does not match the assembly reference. (Exception from HRESULT: 0x80131040)\r\nFile name: 'DocumentFormat.OpenXml, Version=2.7.2.0, Culture=neutral, PublicKeyToken=8fb06cb64d019a17'\r\n\r\nHow to solve this issue?\r\nWhy it reads 2.7.2.0 when i have installed 2.18.0 ??"},{"Id":"24845127400","Type":"PullRequestEvent","CreatedAt":"2022-10-26T15:19:50","Actor":"mikeebowen","Repository":"OfficeDev/Open-XML-SDK","Organization":"OfficeDev","RawContent":null,"RelatedAction":"merged","RelatedUrl":"https://github.com/OfficeDev/Open-XML-SDK/pull/1215","RelatedDescription":"Merged pull request \"Add RichData sample and fix casing for rdRichValueWebImage\" (#1215) at OfficeDev/Open-XML-SDK","RelatedBody":"- Fixes incorrect casing for rdRichValueWebImage part TargetName and TargetPath\r\n- Adds sample for adding RichData to a spreadsheet"}],"ResultType":"GitHubEvent"}},"RunOn":"2022-11-07T03:30:28.9323923Z","RunDurationInMilliseconds":641}